## Plan Result (stg_core)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 26 to add, 2 to change, 28 to destroy.</code></pre>

* Create
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;backend-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;frontend-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;lb-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_ldap&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_mgmt&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_sql&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_sql_ss_ptl&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;frontend-nsg-allow_http&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;frontend-nsg-allow_lb&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;frontend-nsg-allow_mgmt&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;lb-nsg-allow_http&#34;]
  * module.core-infra.module.networking.azurerm_resource_group.new[0]
  * module.core-infra.module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.core-infra.module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.core-infra.module.networking.azurerm_subnet.this[&#34;vnet-nle-int-01-backend&#34;]
  * module.core-infra.module.networking.azurerm_subnet.this[&#34;vnet-nle-int-01-backend-postgresql&#34;]
  * module.core-infra.module.networking.azurerm_subnet.this[&#34;vnet-nle-int-01-frontend&#34;]
  * module.core-infra.module.networking.azurerm_subnet.this[&#34;vnet-nle-int-01-lb&#34;]
  * module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this[&#34;backend-nsg-vnet-nle-int-01-backend&#34;]
  * module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this[&#34;backend-nsg-vnet-nle-int-01-backend-postgresql&#34;]
  * module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this[&#34;frontend-nsg-vnet-nle-int-01-frontend&#34;]
  * module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this[&#34;lb-nsg-vnet-nle-int-01-lb&#34;]
  * module.core-infra.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-nle-int-01-backend&#34;]
  * module.core-infra.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-nle-int-01-backend-postgresql&#34;]
  * module.core-infra.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-nle-int-01-frontend&#34;]
  * module.core-infra.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-nle-int-01-lb&#34;]
* Update
  * module.core-infra.azurerm_backup_policy_vm.this
  * module.core-infra.azurerm_storage_account_network_rules.this
* Delete
  * module.core-infra.azurerm_network_security_group.this[&#34;backend-nsg&#34;]
  * module.core-infra.azurerm_network_security_group.this[&#34;frontend-nsg&#34;]
  * module.core-infra.azurerm_network_security_group.this[&#34;lb-nsg&#34;]
  * module.core-infra.azurerm_network_security_rule.deny_inbound[&#34;backend-nsg&#34;]
  * module.core-infra.azurerm_network_security_rule.deny_inbound[&#34;frontend-nsg&#34;]
  * module.core-infra.azurerm_network_security_rule.deny_inbound[&#34;lb-nsg&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_ldap&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_mgmt&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_sql&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;backend-nsg-allow_sql_ss_ptl&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;frontend-nsg-allow_http&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;frontend-nsg-allow_lb&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;frontend-nsg-allow_mgmt&#34;]
  * module.core-infra.azurerm_network_security_rule.rules[&#34;lb-nsg-allow_http&#34;]
  * module.core-infra.azurerm_route.this[&#34;rt-default&#34;]
  * module.core-infra.azurerm_route_table.this[&#34;rt&#34;]
  * module.core-infra.azurerm_subnet.this[&#34;backend&#34;]
  * module.core-infra.azurerm_subnet.this[&#34;backend-postgresql&#34;]
  * module.core-infra.azurerm_subnet.this[&#34;frontend&#34;]
  * module.core-infra.azurerm_subnet.this[&#34;lb&#34;]
  * module.core-infra.azurerm_subnet_network_security_group_association.this[&#34;backend-nsg-backend&#34;]
  * module.core-infra.azurerm_subnet_network_security_group_association.this[&#34;backend-nsg-backend-postgresql&#34;]
  * module.core-infra.azurerm_subnet_network_security_group_association.this[&#34;frontend-nsg-frontend&#34;]
  * module.core-infra.azurerm_subnet_network_security_group_association.this[&#34;lb-nsg-lb&#34;]
  * module.core-infra.azurerm_subnet_route_table_association.this[&#34;rt-backend&#34;]
  * module.core-infra.azurerm_subnet_route_table_association.this[&#34;rt-backend-postgresql&#34;]
  * module.core-infra.azurerm_subnet_route_table_association.this[&#34;rt-frontend&#34;]
  * module.core-infra.azurerm_subnet_route_table_association.this[&#34;rt-lb&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.core-infra.azurerm_backup_policy_vm.this will be updated in-place
  ~ resource "azurerm_backup_policy_vm" "this" {
        id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.RecoveryServices/vaults/crime-portal-rsv-stg/backupPolicies/crime-portal-daily-bp-stg"
      ~ instant_restore_retention_days = 7 -> 1
        name                           = "crime-portal-daily-bp-stg"
        # (4 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.core-infra.azurerm_network_security_group.this["backend-nsg"] will be destroyed
  # (because azurerm_network_security_group.this is not in configuration)
  - resource "azurerm_network_security_group" "this" {
      - id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-backend-nsg-stg" -> null
      - location            = "uksouth" -> null
      - name                = "crime-portal-backend-nsg-stg" -> null
      - resource_group_name = "InternalSpoke-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = [
                  - "10.25.246.32/28",
                  - "10.25.246.48/28",
                ]
              - destination_application_security_group_ids = []
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "22",
                  - "5432",
                ]
              - direction                                  = "Inbound"
              - name                                       = "backend-nsg-allow_mgmt"
              - priority                                   = 202
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.11.72.32/27",
                  - "10.25.247.32/27",
                  - "10.25.250.0/26",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.32/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "636"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "backend-nsg-allow_ldap"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.25.246.16/28"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.48/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5432"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "backend-nsg-allow_sql"
              - priority                                   = 201
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.25.246.16/28"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.48/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5432"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "backend-nsg-allow_sql_ss_ptl"
              - priority                                   = 203
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.147.64.0/20",
                  - "10.147.80.0/20",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Default DLRM DenyInbound rule"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllInbound"
              - priority                                   = 4096
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "application"  = "crime-portal"
          - "builtFrom"    = "hmcts/crime-portal-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null
    }

  # module.core-infra.azurerm_network_security_group.this["frontend-nsg"] will be destroyed
  # (because azurerm_network_security_group.this is not in configuration)
  - resource "azurerm_network_security_group" "this" {
      - id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-frontend-nsg-stg" -> null
      - location            = "uksouth" -> null
      - name                = "crime-portal-frontend-nsg-stg" -> null
      - resource_group_name = "InternalSpoke-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.16/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "frontend-nsg-allow_lb"
              - priority                                   = 202
              - protocol                                   = "*"
              - source_address_prefix                      = "AzureLoadBalancer"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.16/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "frontend-nsg-allow_mgmt"
              - priority                                   = 201
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.11.72.32/27",
                  - "10.25.247.32/27",
                  - "10.25.250.0/26",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.16/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "frontend-nsg-allow_http"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Default DLRM DenyInbound rule"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllInbound"
              - priority                                   = 4096
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "application"  = "crime-portal"
          - "builtFrom"    = "hmcts/crime-portal-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null
    }

  # module.core-infra.azurerm_network_security_group.this["lb-nsg"] will be destroyed
  # (because azurerm_network_security_group.this is not in configuration)
  - resource "azurerm_network_security_group" "this" {
      - id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-lb-nsg-stg" -> null
      - location            = "uksouth" -> null
      - name                = "crime-portal-lb-nsg-stg" -> null
      - resource_group_name = "InternalSpoke-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.0/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "lb-nsg-allow_http"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Default DLRM DenyInbound rule"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllInbound"
              - priority                                   = 4096
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "application"  = "crime-portal"
          - "builtFrom"    = "hmcts/crime-portal-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null
    }

  # module.core-infra.azurerm_network_security_rule.deny_inbound["backend-nsg"] will be destroyed
  # (because azurerm_network_security_rule.deny_inbound is not in configuration)
  - resource "azurerm_network_security_rule" "deny_inbound" {
      - access                                     = "Deny" -> null
      - description                                = "Default DLRM DenyInbound rule" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "*" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-backend-nsg-stg/securityRules/DenyAllInbound" -> null
      - name                                       = "DenyAllInbound" -> null
      - network_security_group_name                = "crime-portal-backend-nsg-stg" -> null
      - priority                                   = 4096 -> null
      - protocol                                   = "*" -> null
      - resource_group_name                        = "InternalSpoke-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.core-infra.azurerm_network_security_rule.deny_inbound["frontend-nsg"] will be destroyed
  # (because azurerm_network_security_rule.deny_inbound is not in configuration)
  - resource "azurerm_network_security_rule" "deny_inbound" {
      - access                                     = "Deny" -> null
      - description                                = "Default DLRM DenyInbound rule" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "*" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-frontend-nsg-stg/securityRules/DenyAllInbound" -> null
      - name                                       = "DenyAllInbound" -> null
      - network_security_group_name                = "crime-portal-frontend-nsg-stg" -> null
      - priority                                   = 4096 -> null
      - protocol                                   = "*" -> null
      - resource_group_name                        = "InternalSpoke-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.core-infra.azurerm_network_security_rule.deny_inbound["lb-nsg"] will be destroyed
  # (because azurerm_network_security_rule.deny_inbound is not in configuration)
  - resource "azurerm_network_security_rule" "deny_inbound" {
      - access                                     = "Deny" -> null
      - description                                = "Default DLRM DenyInb

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ubnets/crime-portal-backend-postgresql-stg" -> null
      - route_table_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/routeTables/crime-portal-rt-stg" -> null
      - subnet_id      = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-backend-postgresql-stg" -> null
    }

  # module.core-infra.azurerm_subnet_route_table_association.this["rt-frontend"] will be destroyed
  # (because azurerm_subnet_route_table_association.this is not in configuration)
  - resource "azurerm_subnet_route_table_association" "this" {
      - id             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-frontend-stg" -> null
      - route_table_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/routeTables/crime-portal-rt-stg" -> null
      - subnet_id      = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-frontend-stg" -> null
    }

  # module.core-infra.azurerm_subnet_route_table_association.this["rt-lb"] will be destroyed
  # (because azurerm_subnet_route_table_association.this is not in configuration)
  - resource "azurerm_subnet_route_table_association" "this" {
      - id             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
      - route_table_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/routeTables/crime-portal-rt-stg" -> null
      - subnet_id      = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["backend-nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "crime-portal-backend-nsg-stg"
      + resource_group_name = "crime-portal-rg-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["frontend-nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "crime-portal-frontend-nsg-stg"
      + resource_group_name = "crime-portal-rg-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["lb-nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "crime-portal-lb-nsg-stg"
      + resource_group_name = "crime-portal-rg-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["backend-nsg-allow_ldap"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.32/28"
      + destination_port_range      = "636"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "backend-nsg-allow_ldap"
      + network_security_group_name = "crime-portal-backend-nsg-stg"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefix       = "10.25.246.16/28"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["backend-nsg-allow_mgmt"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                       = "Allow"
      + destination_address_prefixes = [
          + "10.25.246.32/28",
          + "10.25.246.48/28",
        ]
      + destination_port_ranges      = [
          + "22",
          + "5432",
        ]
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "backend-nsg-allow_mgmt"
      + network_security_group_name  = "crime-portal-backend-nsg-stg"
      + priority                     = 202
      + protocol                     = "Tcp"
      + resource_group_name          = "crime-portal-rg-stg"
      + source_address_prefixes      = [
          + "10.11.72.32/27",
          + "10.25.247.32/27",
          + "10.25.250.0/26",
        ]
      + source_port_range            = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["backend-nsg-allow_sql"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.48/28"
      + destination_port_range      = "5432"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "backend-nsg-allow_sql"
      + network_security_group_name = "crime-portal-backend-nsg-stg"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefix       = "10.25.246.16/28"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["backend-nsg-allow_sql_ss_ptl"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.48/28"
      + destination_port_range      = "5432"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "backend-nsg-allow_sql_ss_ptl"
      + network_security_group_name = "crime-portal-backend-nsg-stg"
      + priority                    = 203
      + protocol                    = "Tcp"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefixes     = [
          + "10.147.64.0/20",
          + "10.147.80.0/20",
        ]
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["frontend-nsg-allow_http"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.16/28"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "frontend-nsg-allow_http"
      + network_security_group_name = "crime-portal-frontend-nsg-stg"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["frontend-nsg-allow_lb"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.16/28"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "frontend-nsg-allow_lb"
      + network_security_group_name = "crime-portal-frontend-nsg-stg"
      + priority                    = 202
      + protocol                    = "*"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["frontend-nsg-allow_mgmt"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.16/28"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "frontend-nsg-allow_mgmt"
      + network_security_group_name = "crime-portal-frontend-nsg-stg"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefixes     = [
          + "10.11.72.32/27",
          + "10.25.247.32/27",
          + "10.25.250.0/26",
        ]
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["lb-nsg-allow_http"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.0/28"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "lb-nsg-allow_http"
      + network_security_group_name = "crime-portal-lb-nsg-stg"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "crime-portal-rg-stg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "crime-portal-rg-stg"
      + tags     = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.core-infra.module.networking.azurerm_route.this["rt-default"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "rt-default"
      + next_hop_in_ip_address = "10.11.72.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "crime-portal-rg-stg"
      + route_table_name       = "crime-portal-rt-stg"
    }

  # module.core-infra.module.networking.azurerm_route_table.this["rt"] will be created
  + resource "azurerm_route_table" "this" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "crime-portal-rt-stg"
      + resource_group_name           = "crime-portal-rg-stg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.core-infra.module.networking.azurerm_subnet.this["vnet-nle-int-01-backend"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.25.246.32/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "crime-portal-backend-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "crime-portal-rg-stg"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-nle-int-01"
    }

  # module.core-infra.module.networking.azurerm_subnet.this["vnet-nle-int-01-backend-postgresql"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.25.246.48/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "crime-portal-backend-postgresql-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "crime-portal-rg-stg"
      + service_endpoints                              = [
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-nle-int-01"

      + delegation {
          + name = "flexibleserver"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.core-infra.module.networking.azurerm_subnet.this["vnet-nle-int-01-frontend"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.25.246.16/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "crime-portal-frontend-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "crime-portal-rg-stg"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-nle-int-01"
    }

  # module.core-infra.module.networking.azurerm_subnet.this["vnet-nle-int-01-lb"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.25.246.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "crime-portal-lb-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "crime-portal-rg-stg"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-nle-int-01"
    }

  # module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this["backend-nsg-vnet-nle-int-01-backend"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this["backend-nsg-vnet-nle-int-01-backend-postgresql"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this["frontend-nsg-vnet-nle-int-01-frontend"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this["lb-nsg-vnet-nle-int-01-lb"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-nle-int-01-backend"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-nle-int-01-backend-postgresql"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-nle-int-01-frontend"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-nle-int-01-lb"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

Plan: 26 to add, 2 to change, 28 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":24,"Program":"tfcmt","SHA1":"","Target":"stg_core","Vars":{}} -->